/****************************************************************************************
*
*   Объявления и определения некоторых особых вещественных значений с двойной точностью
*   формата IEEE-854
*
*   Автор: Александр Огородников, 2007-2010
*
****************************************************************************************/

// неопределённость
const unsigned Indeterminate[] = {0x00000000, 0xFFF80000};
#define INDETERMINATE		(* (double *) Indeterminate)

// положительная бесконечность
const unsigned PositiveInfinity[] = {0x00000000, 0x7FF00000};
#define POSITIVE_INFINITY	(* (double *) PositiveInfinity)
