/****************************************************************************************
*
*   Объявление модуля FrameWnd
*
*   Создание и управление рамочным окном (главным окном программы).
*
*   Автор: Александр Огородников, 2010
*
****************************************************************************************/

/****************************************************************************************
*
*   Экспортируемые переменные
*
****************************************************************************************/

// описатель рамочного окна
extern HWND g_hwndFrame;

/****************************************************************************************
*
*   Функция FrameWnd_Init
*
*   Параметры
*       Нет
*
*   Возвращаемое значение
*       true, если модуль успешно инициализован; иначе false.
*
*   Инициализирует модуль.
*
****************************************************************************************/

bool FrameWnd_Init();

/****************************************************************************************
*
*   Функция FrameWnd_Uninit
*
*   Параметры
*       Нет
*
*   Возвращаемое значение
*       Нет
*
*   Деинициализирует модуль.
*
****************************************************************************************/

void FrameWnd_Uninit();

/****************************************************************************************
*
*   Функция FrameWnd_Create
*
*   Параметры
*       Нет
*
*   Возвращаемое значение
*       Нет
*
*   Создаёт рамочное окно.
*
****************************************************************************************/

bool FrameWnd_Create();
