/****************************************************************************************
*
*   Объявление модуля Log
*
*   Обеспечивает запись сообщений в журнал отладки.
*
*   Автор: Людмила Огородникова и Александр Огородников, 2007-2010
*
****************************************************************************************/

#ifdef DEBUGLOG

/****************************************************************************************
*
*   Макрос INITLOG
*
*   Параметры
*       pszFileName - указатель на имя файла-журнала отладки
*
*   Возвращаемое значение
*       Нет
*
*   Создаёт файл-журнал отладки с именем, заданным параметром pszFileName.
*
****************************************************************************************/

#define INITLOG		Log_Init

/****************************************************************************************
*
*   Функция Log_Init
*
*   Параметры
*       pszFileName - указатель на имя файла-журнала отладки
*
*   Возвращаемое значение
*       Нет
*
*   Создаёт файл-журнал отладки с именем, заданным параметром pszFileName.
*
****************************************************************************************/

void Log_Init(
	__in LPCTSTR pszFileName);

/****************************************************************************************
*
*   Макрос UNINITLOG
*
*   Параметры
*       Нет
*
*   Возвращаемое значение
*       Нет
*
*   Закрывает файл-журнал отладки.
*
****************************************************************************************/

#define UNINITLOG	Log_Uninit

/****************************************************************************************
*
*   Функция Log_Uninit
*
*   Параметры
*       Нет
*
*   Возвращаемое значение
*       Нет
*
*   Закрывает файл-журнал отладки.
*
****************************************************************************************/

void Log_Uninit();

/****************************************************************************************
*
*   Макрос LOG
*
*   Параметры
*       pszMsg - указатель на строку форматирования
*       ... - опциональные аргументы
*
*   Возвращаемое значение
*       Нет
*
*   Записывает форматированную строку в журнал отладки. Не портит код ошибки,
*   возвращаемый функцией GetLastError.
*
****************************************************************************************/

#define	LOG		Log_Log

/****************************************************************************************
*
*   Функция Log_Log
*
*   Параметры
*       pszMsg - указатель на строку форматирования
*       ... - опциональные аргументы
*
*   Возвращаемое значение
*       Нет
*
*   Записывает форматированную строку в журнал отладки. Не портит код ошибки,
*   возвращаемый функцией GetLastError.
*
****************************************************************************************/

void Log_Log(
	__in LPCSTR pszMsg,
	__in_opt ...);

#else // #ifdef DEBUGLOG

#define INITLOG		1 ? 0 : 
#define UNINITLOG()
#define	LOG			1 ? 0 : 

#endif // #ifdef DEBUGLOG
