/****************************************************************************************
*
*   Заголовочный файл для главного файла проекта
*
*   Осуществляет инициализацию и деинициализацию программы, создаёт рамочное окно и
*   содержит главный цикл программы.
*
*   Автор: Александр Огородников, 2010
*
****************************************************************************************/

/****************************************************************************************
*
*   Экспортируемые переменные
*
****************************************************************************************/

// описатель модуля exe-файла программы
extern HINSTANCE g_hInstance;
