/****************************************************************************************
*
*   Объявление модуля ScrollbarWnd
*
*   Полоса прокрутки для нотного стана - дочернее окно окна нотного стана.
*
*   Автор: Александр Огородников, 2010
*
****************************************************************************************/

/****************************************************************************************
*
*   Функция ScrollbarWnd_Init
*
*   Параметры
*       Нет
*
*   Возвращаемое значение
*       true, если модуль успешно инициализован; иначе false.
*
*   Инициализирует модуль.
*
****************************************************************************************/

bool ScrollbarWnd_Init();

/****************************************************************************************
*
*   Функция ScrollbarWnd_Uninit
*
*   Параметры
*       Нет
*
*   Возвращаемое значение
*       Нет
*
*   Деинициализирует модуль.
*
****************************************************************************************/

void ScrollbarWnd_Uninit();

/****************************************************************************************
*
*   Функция ScrollbarWnd_GetHeight
*
*   Параметры
*       Нет
*
*   Возвращаемое значение
*       Высота полосы прокрутки в пикселах.
*
*   Возвращает высоту полосы прокрутки в пикселах.
*
****************************************************************************************/

int ScrollbarWnd_GetHeight();

/****************************************************************************************
*
*   Функция ScrollbarWnd_Create
*
*   Параметры
*       x - x-координата левого верхнего угла окна
*       y - y-координата левого верхнего угла окна
*       nWidth - ширина окна
*       hwndParent - описатель родительского окна
*
*   Возвращаемое значение
*       Описатель созданного окна полосы прокрутки.
*
*   Создаёт окно полосы прокрутки.
*
****************************************************************************************/

HWND ScrollbarWnd_Create(
	__in int x,
	__in int y,
	__in int nWidth,
	__in HWND hwndParent);
