/****************************************************************************************
*
*   Объявление модуля ShowError
*
*   Обеспечивает вывод сообщений об ошибках.
*
*   Авторы: Александр Огородников и Людмила Огородникова, 2008-2010
*
****************************************************************************************/

/****************************************************************************************
*
*   Константы
*
****************************************************************************************/

// идентификаторы функций
enum FUNCTIONID
{
	FUNCID_REGISTER_CLASS = 1,
	FUNCID_CREATE_WINDOW = 2,
	FUNCID_DIRECT_DRAW_CREATE = 3,
	FUNCID_SET_COOPERATIVE_LEVEL = 4,
	FUNCID_QUERY_INTERFACE = 5,
	FUNCID_CREATE_CLIPPER = 6,
	FUNCID_GET_FILE_SIZE = 7,
	FUNCID_READ_FILE = 8
};

/****************************************************************************************
*
*   Функция ShowError_Init
*
*   Параметры
*       Нет
*
*   Возвращаемое значение
*       true, если модуль успешно инициализован; иначе false.
*
*   Инициализирует модуль.
*
****************************************************************************************/

bool ShowError_Init();

/****************************************************************************************
*
*   Функция ShowError_Uninit
*
*   Параметры
*       Нет
*
*   Возвращаемое значение
*       Нет
*
*   Деинициализирует модуль.
*
****************************************************************************************/

void ShowError_Uninit();

/****************************************************************************************
*
*   Функция ShowError
*
*   Параметры
*       MsgId - идентификатор сообщения об ошибке
*
*   Возвращаемое значение
*       Нет
*
*   Выводит сообщение об ошибке. Сообщение идентифицируется параметром MsgId.
*
****************************************************************************************/

void ShowError(
	__in TEXTMESSAGEID0 MsgId);

/****************************************************************************************
*
*   Функция ShowError
*
*   Параметры
*       MsgId - идентификатор сообщения об ошибке
*       ErrorCode - код ошибки (например, возвращённый функцией GetLastError)
*
*   Возвращаемое значение
*       Нет
*
*   Выводит сообщение об ошибке с указанием кода ошибки. Сообщение идентифицируется
*   параметром MsgId.
*
****************************************************************************************/

void ShowError(
	__in TEXTMESSAGEID1 MsgId,
	__in DWORD ErrorCode);

/****************************************************************************************
*
*   Функция ShowError
*
*   Параметры
*       MsgId - идентификатор сообщения об ошибке
*       FunctionId - идентификатор функции,в которой произошла ошибка
*       ErrorCode - код ошибки, который вернула функция (в том числе, возвращённый
*                   функцией GetLastError)
*
*   Возвращаемое значение
*       Нет
*
*   Выводит сообщение об ошибке с указанием идентификатора функции,в которой произошла
*   ошибка, и кода ошибки. Сообщение идентифицируется параметром MsgId.
*
****************************************************************************************/

void ShowError(
	__in TEXTMESSAGEID2 MsgId,
	__in FUNCTIONID FunctionId,
	__in DWORD ErrorCode);

/****************************************************************************************
*
*   Функция ShowFatalError
*
*   Параметры
*       MsgId - идентификатор сообщения об ошибке
*
*   Возвращаемое значение
*       Нет
*
*   Выводит сообщение о фатальной ошибке. Сообщение идентифицируется параметром MsgId.
*
****************************************************************************************/

void ShowFatalError(
	__in TEXTMESSAGEID0 MsgId);

/****************************************************************************************
*
*   Функция ShowFatalError
*
*   Параметры
*       MsgId - идентификатор сообщения об ошибке
*       ErrorCode - код ошибки (например, возвращённый функцией GetLastError)
*
*   Возвращаемое значение
*       Нет
*
*   Выводит сообщение о фатальной ошибке с указанием кода ошибки. Сообщение
*   идентифицируется параметром MsgId.
*
****************************************************************************************/

void ShowFatalError(
	__in TEXTMESSAGEID1 MsgId,
	__in DWORD ErrorCode);

/****************************************************************************************
*
*   Функция ShowFatalError
*
*   Параметры
*       MsgId - идентификатор сообщения об ошибке
*       FunctionId - идентификатор функции,в которой произошла ошибка
*       ErrorCode - код ошибки, который вернула функция (в том числе, возвращённый
*                   функцией GetLastError)
*
*   Возвращаемое значение
*       Нет
*
*   Выводит сообщение о фатальной ошибке с указанием идентификатора функции, в которой
*   произошла ошибка, и кода ошибки. Сообщение идентифицируется параметром MsgId.
*
****************************************************************************************/

void ShowFatalError(
	__in TEXTMESSAGEID2 MsgId,
	__in FUNCTIONID FunctionId,
	__in DWORD ErrorCode);

/****************************************************************************************
*
*   Функция ShowError_GetLastMsgId
*
*   Параметры
*       Нет
*
*   Возвращаемое значение
*       Идентификатор последнего сообщения об ошибке.
*
*   Возвращает идентификатор последнего показанного пользователю сообщения об ошибке.
*
****************************************************************************************/

DWORD ShowError_GetLastMsgId();
