/****************************************************************************************
*
*   Объявление модуля SimpleStaveFast
*
*   Рисует нотный стан в упрощённом режиме (быстрый вариант отрисовки).
*
*   Авторы: Александр Огородников и Людмила Огородникова, 2010
*
****************************************************************************************/

/****************************************************************************************
*
*   Функция SimpleStaveFast_Activate
*
*   Параметры
*       StaveWidth - ширина нотного стана
*       StaveHeight - высота нотного стана
*       pSong - указатель на объект класса Song, представляющий собой песню; этот
*               параметр может быть равен NULL
*
*   Возвращаемое значение
*       true, если модуль успешно активирован; иначе false.
*
*   Активирует модуль.
*
****************************************************************************************/

bool SimpleStaveFast_Activate(
	__in int StaveWidth,
	__in int StaveHeight,
	__in_opt Song *pSong);

/****************************************************************************************
*
*   Функция SimpleStaveFast_Deactivate
*
*   Параметры
*       Нет
*
*   Возвращаемое значение
*       Нет
*
*   Деактивирует модуль.
*
****************************************************************************************/

void SimpleStaveFast_Deactivate();

/****************************************************************************************
*
*   Функция SimpleStaveFast_SetStaveSize
*
*   Параметры
*       StaveWidth - ширина нотного стана
*       StaveHeight - высота нотного стана
*
*   Возвращаемое значение
*       Нет
*
*   Устанавливает новые ширину и высоту нотного стана.
*
****************************************************************************************/

void SimpleStaveFast_SetStaveSize(
	__in int StaveWidth,
	__in int StaveHeight);

/****************************************************************************************
*
*   Функция SimpleStaveFast_GlobalDraw
*
*   Параметры
*       hwnd - описатель окна, которое содержит в себе нотный стан
*
*   Возвращаемое значение
*       Нет
*
*   Полностью перерисовывает нотный стан в соответствии с его текущим состоянием.
*
****************************************************************************************/

void SimpleStaveFast_GlobalDraw(
	__in HWND hwnd);

/****************************************************************************************
*
*   Функция SimpleStaveFast_LocalDraw
*
*   Параметры
*       hwnd - описатель окна, которое содержит в себе нотный стан
*
*   Возвращаемое значение
*       Нет
*
*   Перерисовывает нотный стан во время пения в соответствии с его текущим состоянием и
*   обновляет это состояние.
*
****************************************************************************************/

void SimpleStaveFast_LocalDraw(
	__in HWND hwnd);
