/****************************************************************************************
*
*   Объявление модуля StaveWnd
*
*   Дочернее окно рамочного окна, отображающее нотный стан.
*
*   Автор: Людмила Огородникова и Александр Огородников, 2007-2010
*
****************************************************************************************/

/****************************************************************************************
*
*   Функция StaveWnd_Init
*
*   Параметры
*       Нет
*
*   Возвращаемое значение
*       true, если модуль успешно инициализован; иначе false.
*
*   Инициализирует модуль.
*
****************************************************************************************/

bool StaveWnd_Init();

/****************************************************************************************
*
*   Функция StaveWnd_Uninit
*
*   Параметры
*       Нет
*
*   Возвращаемое значение
*       Нет
*
*   Деинициализирует модуль.
*
****************************************************************************************/

void StaveWnd_Uninit();

/****************************************************************************************
*
*   Функция StaveWnd_Create
*
*   Параметры
*       x - x-координата левого верхнего угла окна
*       y - y-координата левого верхнего угла окна
*       nWidth - ширина окна
*       nHeight - высота окна
*       hwndParent - описатель родительского окна
*
*   Возвращаемое значение
*       Описатель созданного окна нотного стана.
*
*   Создаёт окно нотного стана.
*
****************************************************************************************/

HWND StaveWnd_Create(
	__in int x,
	__in int y,
	__in int nWidth,
	__in int nHeight,
	__in HWND hwndParent);
