/****************************************************************************************
*
*   Объявление модуля TextMessages
*
*   Обеспечивает получение текстовых сообщений на выбранном пользователем языке.
*
*   Авторы: Людмила Огородникова и Александр Огородников, 2009-2010
*
****************************************************************************************/

/****************************************************************************************
*
*   Константы
*
****************************************************************************************/

// недействительный идентификатор текстового сообщения
#define MSGID_UNDEFINED		0

// идентификаторы текстовых сообщений без параметров
enum TEXTMESSAGEID0
{
	// сообщения об ошибках
	MSGID_CANT_ALLOC_MEMORY = 1,
	MSGID_UNSUPPORTED_SCREEN_PIXEL_FORMAT = 2,
	MSGID_CORRUPTED_MIDI_FILE = 3,
	MSGID_CORRUPTED_KAR_FILE = 4,
	MSGID_UNSUPPORTED_FILE_FORMAT = 5,
	MSGID_UNSUPPORTED_MIDI_FILE_FORMAT = 6,
	MSGID_NO_VOCAL_PARTS = 7,
	MSGID_NO_LYRIC = 8,

	// типы файлов для диалога GetOpenFileName
	MSGID_ALL_FILES = 500,
	MSGID_ALL_SUPPORTED_FILES = 501,
	MSGID_MIDI_FILES = 502,
	MSGID_KARAOKE_FILES = 503
};

// идентификаторы текстовых сообщений с 1-м параметром
enum TEXTMESSAGEID1
{
	// сообщения об ошибках
	MSGID_CANT_CREATE_PRIMARY_SURFACE = 1000,
	MSGID_CANT_SET_CLIPPER = 1001,
	MSGID_CANT_GET_SCREEN_RESOLUTION = 1002,
	MSGID_CANT_GET_SCREEN_PIXEL_FORMAT = 1003,
	MSGID_CANT_CREATE_SURFACE = 1004,
	MSGID_CANT_GET_DC = 1005,
	MSGID_CANT_SET_HWND_FOR_CLIPPING = 1006,
	MSGID_CANT_BLT_TO_SCREEN = 1007,
	MSGID_CANT_BLT_FROM_SCREEN = 1008,
	MSGID_CANT_RESTORE_PRIMARY_SURFACE = 1009,
	MSGID_GRADIENT_FILL_FAILED = 1010,
	MSGID_CANT_OPEN_FILE = 1011
};

// идентификаторы текстовых сообщений с 2-мя параметрами
enum TEXTMESSAGEID2
{
	// сообщения об ошибках
	MSGID_CANT_INIT_PROGRAM = 2000,
	MSGID_CANT_LOAD_FILE = 2001
};

/****************************************************************************************
*
*   Функция TextMessages_Init
*
*   Параметры
*       Нет
*
*   Возвращаемое значение
*       true, если модуль успешно инициализован; иначе false.
*
*   Инициализирует модуль.
*
****************************************************************************************/

bool TextMessages_Init();

/****************************************************************************************
*
*   Функция TextMessages_Uninit
*
*   Параметры
*       Нет
*
*   Возвращаемое значение
*       Нет
*
*   Деинициализирует модуль.
*
****************************************************************************************/

void TextMessages_Uninit();

/****************************************************************************************
*
*   Функция TextMessages_GetMessage
*
*   Параметры
*       MsgId - идентификатор текстового сообщения, указатель на которое нужно вернуть
*
*   Возвращаемое значение
*       Указатель на текстовое сообщение или NULL, если произошла ошибка.
*
*   Возвращает указатель на текстовое сообщение, заданное параметром MsgId.
*
****************************************************************************************/

LPCTSTR TextMessages_GetMessage(
	__in DWORD MsgId);
