/****************************************************************************************
*
*   Объявление модуля ToolbarWnd
*
*   Панель инструментов - дочернее окно рамочного окна.
*
*   Автор: Александр Огородников, 2010
*
****************************************************************************************/

/****************************************************************************************
*
*   Функция ToolbarWnd_Init
*
*   Параметры
*       Нет
*
*   Возвращаемое значение
*       true, если модуль успешно инициализован; иначе false.
*
*   Инициализирует модуль.
*
****************************************************************************************/

bool ToolbarWnd_Init();

/****************************************************************************************
*
*   Функция ToolbarWnd_Uninit
*
*   Параметры
*       Нет
*
*   Возвращаемое значение
*       Нет
*
*   Деинициализирует модуль.
*
****************************************************************************************/

void ToolbarWnd_Uninit();

/****************************************************************************************
*
*   Функция ToolbarWnd_GetHeight
*
*   Параметры
*       Нет
*
*   Возвращаемое значение
*       Высота панели инструментов в пикселах.
*
*   Возвращает высоту панели инструментов в пикселах.
*
****************************************************************************************/

int ToolbarWnd_GetHeight();

/****************************************************************************************
*
*   Функция ToolbarWnd_Create
*
*   Параметры
*       x - x-координата левого верхнего угла окна
*       y - y-координата левого верхнего угла окна
*       nWidth - ширина окна
*       hwndParent - описатель родительского окна
*
*   Возвращаемое значение
*       Описатель созданного окна панели инструментов.
*
*   Создаёт окно панели инструментов.
*
****************************************************************************************/

HWND ToolbarWnd_Create(
	__in int x,
	__in int y,
	__in int nWidth,
	__in HWND hwndParent);
